"""
Задание 3.

Для этой задачи:
1) придумайте 1-3 решения (желательно хотя бы два)
2) оцените сложность каждого решения в нотации О-большое
3) сделайте вывод, какое решение эффективнее и почему

Примечание:
Без выполнения пунктов 2 и 3 задание считается нерешенным. Пункты 2 и 3 можно выполнить
через строки документации в самом коде.
Если у вас возникают сложности, постарайтесь подумать как можно решить задачу,
а не писать "мы это не проходили)".
Алгоритмизатор должен развивать мышление, а это прежде всего практика.
А без столкновения со сложностями его не развить.


Сама задача:
Имеется хранилище с информацией о компаниях: название и годовая прибыль.
Для реализации хранилища можно применить любой подход,
который вы придумаете, например, реализовать словарь.
Реализуйте поиск трех компаний с наибольшей годовой прибылью.
Выведите результат.
"""

total = {
    "romashka":1024, 
    "dom":245,
    "digi": 2468,
    "kraft":9265,
    "beerconsul": 7441
}

s= list(total.items())

def value:
  for i in s:
        min = True
        for x in s:
            if i > x:
                min = False
        if min:
            return i

for i in s:
    print (i[0], ':', i[1]) 

s.sort(key=lambda i: i[])

#O(N^2)